export const ProgramsText = [
  {
    id: 1,
    title: "مسار الحفظ",
    programs: [
      {
        title: "مسار وجهين",
        list: [
          {
            label: "المدة",
            value: "سنة واحدة",
          },
          {
            label: "مقدار الحفظ",
            value: "وجهان يوميًا",
          },
          {
            label: "أيام الحفظ",
            value: "جميع أيام الأسبوع",
          },
        ],
      },
      {
        title: "مسار وجه واحد",
        list: [
          {
            label: "المدة",
            value: "سنتان",
          },
          {
            label: "مقدار الحفظ",
            value: "وجه واحد يوميًا",
          },
          {
            label: "أيام الحفظ",
            value: "جميع أيام الأسبوع",
          },
        ],
      },
      {
        title: "مسار 3 اوجه",
        list: [
          {
            label: "المدة",
            value: "سنة واحدة",
          },
          {
            label: "مقدار الحفظ",
            value: "وجهان يوميًا",
          },
          {
            label: "أيام الحفظ",
            value: "جميع أيام الأسبوع",
          },
        ],
      },
    ],
    details:
      "هو مسار لحفظ القرآن وضبطه, وفق إطار منهجي ومرسوم, يحفظ المشارك فيه القرآن كاملَا بإتقان وضبط ",
  },
  {
    id: 2,
    title: "مسار الإتقان",
    programs: [
      {
        title: "مسار وجهين",
        list: [
          {
            label: "المدة",
            value: "سنة واحدة",
          },
          {
            label: "مقدار الحفظ",
            value: "وجهان يوميًا",
          },
          {
            label: "أيام الحفظ",
            value: "جميع أيام الأسبوع",
          },
        ],
      },
      {
        title: "مسار وجه واحد",
        list: [
          {
            label: "المدة",
            value: "سنتان",
          },
          {
            label: "مقدار الحفظ",
            value: "وجه واحد يوميًا",
          },
          {
            label: "أيام الحفظ",
            value: "جميع أيام الأسبوع",
          },
        ],
      },
    ],
    details:
      "هو مسار لحفظ القرآن وضبطه, وفق إطار منهجي ومرسوم, يحفظ المشارك فيه القرآن كاملَا بإتقان وضبط ",
  },
  {
    id: 3,
    title: "مسار الإقراء",
    programs: [
      {
        title: "مسار وجهين",
        list: [
          {
            label: "المدة",
            value: "سنة واحدة",
          },
          {
            label: "مقدار الحفظ",
            value: "وجهان يوميًا",
          },
          {
            label: "أيام الحفظ",
            value: "جميع أيام الأسبوع",
          },
        ],
      },
      {
        title: "مسار وجه واحد",
        list: [
          {
            label: "المدة",
            value: "سنتان",
          },
          {
            label: "مقدار الحفظ",
            value: "وجه واحد يوميًا",
          },
          {
            label: "أيام الحفظ",
            value: "جميع أيام الأسبوع",
          },
        ],
      },
    ],
    details:
      "هو مسار لحفظ القرآن وضبطه, وفق إطار منهجي ومرسوم, يحفظ المشارك فيه القرآن كاملَا بإتقان وضبط ",
  },
] as const;

export type ProgramsTextType = typeof ProgramsText;
